## mesazon-clusters-dev
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`
#### Changes Detected 🚨 `true`

<details><summary>Show Plan</summary>

```

terraform
module.gateway_pg_cluster.data.digitalocean_project.project: Reading...
module.gateway_pg_cluster.data.digitalocean_project.project: Read complete after 0s [id=5d792a15-cf5f-46c7-ab46-425f64c52ea4]
module.gateway_pg_cluster.digitalocean_database_cluster.pg_cluster: Refreshing state... [id=9acb920f-367f-406a-a9fd-c429d091e030]
module.gateway_pg_cluster.digitalocean_database_db.pg_db: Refreshing state... [id=9acb920f-367f-406a-a9fd-c429d091e030/database/gateway_db_fra1_dev]
module.gateway_pg_cluster.digitalocean_database_postgresql_config.pg_config: Refreshing state... [id=9acb920f-367f-406a-a9fd-c429d091e030/postgresql-config]
module.gateway_pg_cluster.digitalocean_database_connection_pool.pg_pool: Refreshing state... [id=9acb920f-367f-406a-a9fd-c429d091e030/gateway-pool-01-fra1-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gateway_pg_cluster.digitalocean_database_firewall.block_all will be created
  + resource "digitalocean_database_firewall" "block_all" {
      + cluster_id = "9acb920f-367f-406a-a9fd-c429d091e030"
      + id         = (known after apply)

      + rule {
          + created_at = (known after apply)
          + type       = "tag"
          + uuid       = (known after apply)
          + value      = "block-all"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>